### Part 1 ###

Import libraries

In [41]:
from cgi import print_arguments
import pandas as pd

Create dataframes for each file to extract columns

In [42]:
df_1 = pd.read_csv('cons_email.csv' , usecols = ['email','create_dt','modified_dt'])
df_2 = pd.read_csv('cons_email_chapter_subscription.csv' , usecols = ['isunsub'])
df_3 = pd.read_csv('cons.csv' , usecols = ['source'])

Merge all 3 dataframes into 1

In [43]:
df_all = pd.concat([df_1, df_2, df_3], axis = 1 )
df_all.head()

,email,create_dt,modified_dt,isunsub,source
0,xmartinez@vincent.com,"Wed, 1994-01-26 23:49:16","Sat, 2014-04-19 19:10:39",1.0,google
1,hmiller@haynes.biz,"Thu, 1999-12-09 06:18:27","Sat, 1984-07-14 05:55:27",1.0,facebook
2,aaron64@yahoo.com,"Wed, 1992-11-18 16:46:27","Sun, 1995-12-24 13:13:01",1.0,NaN
3,wyattvincent@hotmail.com,"Sat, 1983-11-26 16:49:14","Sun, 1975-01-19 14:32:56",1.0,google
4,tspencer@hotmail.com,"Wed, 2000-11-15 13:28:34","Sun, 1994-03-13 16:38:37",1.0,NaN

Change names

In [44]:
df_all.rename(columns = {'create_dt':'created_dt', 'source':'code', 'isunsub':'is_unsub', 'modified_dt':'updated_dt'}, inplace = True)
df_all.head()

,email,created_dt,updated_dt,is_unsub,code
0,xmartinez@vincent.com,"Wed, 1994-01-26 23:49:16","Sat, 2014-04-19 19:10:39",1.0,google
1,hmiller@haynes.biz,"Thu, 1999-12-09 06:18:27","Sat, 1984-07-14 05:55:27",1.0,facebook
2,aaron64@yahoo.com,"Wed, 1992-11-18 16:46:27","Sun, 1995-12-24 13:13:01",1.0,NaN
3,wyattvincent@hotmail.com,"Sat, 1983-11-26 16:49:14","Sun, 1975-01-19 14:32:56",1.0,google
4,tspencer@hotmail.com,"Wed, 2000-11-15 13:28:34","Sun, 1994-03-13 16:38:37",1.0,NaN

Cnange Order

In [45]:
df_all = df_all[['email', 'code', 'is_unsub', 'created_dt', 'updated_dt']]
df_all.head()

,email,code,is_unsub,created_dt,updated_dt
0,xmartinez@vincent.com,google,1.0,"Wed, 1994-01-26 23:49:16","Sat, 2014-04-19 19:10:39"
1,hmiller@haynes.biz,facebook,1.0,"Thu, 1999-12-09 06:18:27","Sat, 1984-07-14 05:55:27"
2,aaron64@yahoo.com,NaN,1.0,"Wed, 1992-11-18 16:46:27","Sun, 1995-12-24 13:13:01"
3,wyattvincent@hotmail.com,google,1.0,"Sat, 1983-11-26 16:49:14","Sun, 1975-01-19 14:32:56"
4,tspencer@hotmail.com,NaN,1.0,"Wed, 2000-11-15 13:28:34","Sun, 1994-03-13 16:38:37"

Fix Data Types

In [46]:
df_all['email'] =       df_all['email']                 .astype("|S")                   # Object -> string
df_all['code'] =        df_all['code']                  .astype("|S")                   # Object -> string
df_all['is_unsub'] =    df_all['is_unsub']              .astype(bool)                   # int64  -> boolean
df_all['created_dt']=                           pd.to_datetime(df_all['created_dt'])    # Object -> datetime
df_all['updated_dt']=                           pd.to_datetime(df_all['updated_dt'])    # Object -> datetime

# apply the dtype attribute
result = df_all.dtypes

print("Output:")
print(result)
df_all.head()

Output:
email                   |S45
code                     |S8
is_unsub                bool
created_dt    datetime64[ns]
updated_dt    datetime64[ns]
dtype: object

,email,code,is_unsub,created_dt,updated_dt
0,b'xmartinez@vincent.com',b'google',True,1994-01-26 23:49:16,2014-04-19 19:10:39
1,b'hmiller@haynes.biz',b'facebook',True,1999-12-09 06:18:27,1984-07-14 05:55:27
2,b'aaron64@yahoo.com',b'nan',True,1992-11-18 16:46:27,1995-12-24 13:13:01
3,b'wyattvincent@hotmail.com',b'google',True,1983-11-26 16:49:14,1975-01-19 14:32:56
4,b'tspencer@hotmail.com',b'nan',True,2000-11-15 13:28:34,1994-03-13 16:38:37

Create 'people.csv' file

In [47]:
df_all.to_csv('people.csv' , index = False)

### Part 2 ###

Read and obtain columns csv file from 'people'

In [48]:
df_agg = pd.read_csv('people.csv', usecols = ['created_dt'])

Rename column ( create_dt -> acquisition_date )

In [49]:
df_agg.rename(columns=({'created_dt' : 'acquisition_date'}),inplace=True,)
df_agg.head()

      acquisition_date
0  1994-01-26 23:49:16
1  1999-12-09 06:18:27
2  1992-11-18 16:46:27
3  1983-11-26 16:49:14
4  2000-11-15 13:28:34

Date/time -> Date

In [50]:
str_dates = []
for _,val in df_agg["acquisition_date"].iteritems():
    str_dates.append(str(val)[0:10])

str_dates[0:15]

['1994-01-26',
 '1999-12-09',
 '1992-11-18',
 '1983-11-26',
 '2000-11-15',
 '1984-03-08',
 '1975-11-25',
 '1973-11-11',
 '1976-06-28',
 '1988-08-07',
 '1991-07-16',
 '1996-10-30',
 '2017-01-29',
 '1991-12-17',
 '1977-09-05']

Putting Date into the dataframe

In [51]:
df_agg["acquisition_date"] = str_dates 
df_agg.head()

  acquisition_date
0       1994-01-26
1       1999-12-09
2       1992-11-18
3       1983-11-26
4       2000-11-15

Create count value for 'acquisitions' from "acquisition_date"

In [52]:
df = df_agg["acquisition_date"].value_counts().rename_axis('acquisition_date').reset_index(name='acquisitions')
df[0:6]

  acquisition_date  acquisitions
0       1997-11-15           112
1       1979-01-18           111
2       1980-09-15           110
3       1974-08-23           108
4       1982-03-01           108
5       1993-05-15           107

Fix Data Types

In [55]:
df['acquisition_date']= pd.to_datetime(df['acquisition_date'])
# apply the dtype attribute
result = df.dtypes

print("Output:")
print(result)
df.head()

Output:
acquisition_date    datetime64[ns]
acquisitions                 int64
dtype: object

  acquisition_date  acquisitions
0       1997-11-15           112
1       1979-01-18           111
2       1980-09-15           110
3       1974-08-23           108
4       1982-03-01           108

Create 'acquisition_facts.csv' file

In [40]:
df.to_csv('acquisition_facts.csv' , index = False)